artillery/test.yml
config:
  target: "https://chytozavrik-frontend.vercel.app/"
  phases:
    - duration: 20  
      arrivalRate: 50  
      rampTo: 100  
      name: "Phase 1"

    - duration: 20  
      arrivalRate: 60  
      rampTo: 150  
      name: "Phase 2"

    - duration: 20 
      arrivalRate: 70  
      rampTo: 200  
      name: "Phase 3"

    - duration: 20  
      arrivalRate: 80  
      rampTo: 200  
      name: "Phase 4"

    - duration: 20  
      arrivalRate: 100  
      rampTo: 200 
      name: "Phase 5"

scenarios:
  - name: "Getting a resource"
    flow:
      - get:
          url: "{{ target }}get"
      - think: 2